# column의 str값에 따라 dataframe 묶어 분리하기
> column의 값들이 int나 float가 아닌 str일 경우, 보다 주의깊게 살펴보고 싶은 특정값이 있을 수 있다. 그럴 경우 그 column에서 해당 값만을 가진 행들을 분리하여 하나의 dataframe으로 만들 수 있다. 

- 또한, 해당 column의 값들이 몇 가지 되지 않는다면, 각각의 값들을 가진 행들을 분리하여 존재하는 값만큼의 dataframe을 만들 수 있다.

In [5]:
# 라이브러리 불러오기
import pandas as pd
import sys

In [3]:
# 샘플 데이터 만들기 
col1='방문횟수'
col2='이름'
col3='주문 메뉴'

df=pd.DataFrame(data={col1:[11,23,44,12,66,70], col2:['김마리아', '남자현', '유관순', '박자혜', '권기옥', '윤희순'], col3:['볶음밥', '김치찌개', '된장찌개', '된장찌개', '볶음밥', '김치찌개']})

In [4]:
# 데이터 확인
df

   방문횟수    이름 주문 메뉴
0    11  김마리아   볶음밥
1    23   남자현  김치찌개
2    44   유관순  된장찌개
3    12   박자혜  된장찌개
4    66   권기옥   볶음밥
5    70   윤희순  김치찌개

In [6]:
# 상품명 기준으로 데이터 분리하는 함수

def dataframe_divide(df, col_name):
    name_li = list(set(df[col_name].tolist()))
    mod=sys.modules[__name__]
    
    for i in range(len(name_li)):
        setattr(mod, 'menu_{}'.format(i), df[df[col_name]== name_li[i]])
    
    print('데이터 분리 완료')

In [7]:
# 함수 적용
dataframe_divide(df, '주문 메뉴')

데이터 분리 완료

In [8]:
# 분리된 데이터 확인
menu_0

   방문횟수   이름 주문 메뉴
2    44  유관순  된장찌개
3    12  박자혜  된장찌개

In [9]:
menu_1

   방문횟수   이름 주문 메뉴
1    23  남자현  김치찌개
5    70  윤희순  김치찌개

In [10]:
menu_2

   방문횟수    이름 주문 메뉴
0    11  김마리아   볶음밥
4    66   권기옥   볶음밥

위의 함수를 응용해 특정 행만 뽑아내거나 슬라이싱하는 것도 가능하다.

In [20]:
# 첫 번째 행만 뽑아내기
def dataframe_divide_and_slice1(df, col_name):
    name_li = list(set(df[col_name].tolist()))
    mod=sys.modules[__name__]
    
    for i in range(len(name_li)):
        setattr(mod, 'menu_slice_{}'.format(i), df[df[col_name]== name_li[i]][:1])
    
    print('데이터 분리 완료')

In [21]:
dataframe_divide_and_slice1(df, '주문 메뉴')

데이터 분리 완료

In [17]:
# 데이터 확인
menu_slice_0

   방문횟수   이름 주문 메뉴
2    44  유관순  된장찌개

In [18]:
menu_slice_1

   방문횟수   이름 주문 메뉴
1    23  남자현  김치찌개

In [19]:
menu_slice_2

   방문횟수    이름 주문 메뉴
0    11  김마리아   볶음밥